ADMIN_ID=6135974357

START_TEXT = """
🎵 Салом!

Ман метавонам:

📥 Видео скачат кунам
🎧 MP3 ҷудо кунам
🧠 Мусиқиро ёбам
🔥 Суруди пурраро ёбам

Ссылка фирист 😄
"""

INVALID_LINK = "❌ Лутфан ссылкаи дуруст фирист."

DOWNLOADING_VIDEO = "📥 Видео скачат шуда истодааст..."

EXTRACTING_AUDIO = "🎵 Аудио ҷудо шуда истодааст..."

RECOGNIZING_MUSIC = "🧠 Мусиқӣ шинохта шуда истодааст..."

DOWNLOADING_FULL_SONG = "🎧 Суруди пурра скачат шуда истодааст..."

MUSIC_NOT_FOUND = "😢 Мусиқӣ ёфт нашуд."

DONE = "✅ Тайёр!"

SEARCHING_SONG = "🔍 Суруд ҷустуҷӯ шуда истодааст..."

